# Absolute and Relative Data

- Absolute data: data that is colected from the font without any kind of manipulation (only sum or sorting).

- Relative data: data that has some kind of manipulation which will help to understand and compare the data. Such as:
porcentages, indexes, coefficients and rates.

- Indexes: ratio between two quantities, summarizes in a single number the general behavior of a variable.
- Coefficient: ratio between the number of occurrences and the total number.
- Rates: coefficient multiplied by a power of 10 or 100 or 1000.

In [21]:
import pandas as pd

In [22]:
#Number of employees hired 
data = {'Job':['Database_Maneger', 'Programmer', 'Computer_Networ_Architect'],
        'new_jersey': [97350, 82080, 112840],
        'florida': [77140, 71540, 62310]}

In [23]:
df = pd.DataFrame(data)

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df

                         Job  new_jersey  florida
0           Database_Maneger       97350    77140
1                 Programmer       82080    71540
2  Computer_Networ_Architect      112840    62310

In [26]:
df['new_jersey'].sum()

292270

In [27]:
df['florida'].sum()

210990

In [28]:
#Calculating the percentage

df['%_new_jersey'] = (df['new_jersey'] / df['new_jersey'].sum()) * 100
df['%_florida'] = (df['florida'] / df['florida'].sum()) * 100

In [20]:
df

                         Job  new_jersey  florida  %_new_jersey  %_florida
0           Database_Maneger       97350    77140     33.308242  36.560974
1                 Programmer       82080    71540     28.083621  33.906820
2  Computer_Networ_Architect      112840    62310     38.608136  29.532205

In [30]:
df2 = pd.DataFrame({'Gratuation year': ['1º', '2º', '3º', '4º', 'total'],
          'March enrollment':[70, 50, 47, 23, 190],
          'November enrollment': [65, 48, 40, 22,175]})

In [31]:
type(df2)

pandas.core.frame.DataFrame

In [32]:
df2['Dropout Rate'] = (df2['March enrollment'] - df2['November enrollment']) / df2['March enrollment'] * 100

In [33]:
df2

  Gratuation year  March enrollment  November enrollment  Dropout Rate
0              1º                70                   65      7.142857
1              2º                50                   48      4.000000
2              3º                47                   40     14.893617
3              4º                23                   22      4.347826
4           total               190                  175      7.894737